app/controllers/admin/account_types_controller.rb

SELECT `account_types`.* FROM `account_types` ORDER BY name asc LIMIT 5 OFFSET 0
---
  def index
    @account_types = AccountType.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )