app/controllers/admin/districts_controller.rb

  def index
    @districts = District.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )
---
SELECT COUNT(*) FROM `districts`
SELECT `districts`.* FROM `districts` ORDER BY name asc LIMIT 5 OFFSET 0