app/controllers/admin/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` ORDER BY name asc LIMIT 20 OFFSET 0
---
  def index
    @users = User.paginate :page => params[:page], :per_page=>10,:order => 'created_at DESC'