app/controllers/admin/vle_representatives_controller.rb

SELECT `roles`.* FROM `roles` WHERE `roles`.`name` = 'vle_representative' LIMIT 1
SELECT COUNT(*) FROM `users` INNER JOIN `assignments` ON `users`.id = `assignments`.user_id WHERE ((`assignments`.role_id = 3))
SELECT `users`.* FROM `users` INNER JOIN `assignments` ON `users`.id = `assignments`.user_id WHERE ((`assignments`.role_id = 3)) ORDER BY name asc LIMIT 5 OFFSET 0
---
  def index
    role = Role.find_by_name('vle_representative')
    @vle_users = role.users.order.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def show
    @vle_user =  User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `updated_by` = 2, `password_salt` = 'Zx54MrH3LQzBailoqo8T', `crypted_password` = 'f1936c5daf8b23fb29ea4239801aee641347c9c746502d4707e503de76f471fb958d8628e08f5004fffe4fac2a34e156fb15536b9575f1115880936707266ff4', `persistence_token` = 'dccf234c6cfd959f33adfd3f7f5fe3b61ebd3434bf8e1396f40b83181539c7b945df0c9ffff11d4fc6c5e0978c1328b258efd748b4c6bde7d12e4f6361e158bb', `updated_at` = '2011-05-02 09:47:35' WHERE `users`.`id` = 461
---
  def update
    @user = User.find(params[:id])
    @user.updated_by = @updated_by

SELECT `vle_documents`.* FROM `vle_documents`
---
  def vle_document
    @vle_documents = VleDocument.all

SELECT `roles`.* FROM `roles` WHERE `roles`.`name` = 'vle_representative' LIMIT 1
SELECT COUNT(*) FROM `users` INNER JOIN `assignments` ON `users`.id = `assignments`.user_id WHERE ((`assignments`.role_id = 3))
SELECT `users`.* FROM `users` INNER JOIN `assignments` ON `users`.id = `assignments`.user_id WHERE ((`assignments`.role_id = 3)) ORDER BY name desc LIMIT 5 OFFSET 0
---
  def vle_profile
    role = Role.find_by_name('vle_representative')
    @vle_users = role.users.order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )

SELECT `roles`.* FROM `roles` WHERE `roles`.`name` = 'vle_representative' LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `assignments` ON `users`.id = `assignments`.user_id WHERE ((`assignments`.role_id = 3))
---
  def disable_representative
      role = Role.find_by_name('vle_representative')
     @users = role.users.order.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `password_salt` = 'SlAKVRtp5yz2h6CgLAec', `crypted_password` = 'ae25559c58d823c69b0e810e42aee4dac921f8c9ce4c38c7daffe89b6e7fa93533465236597a6f3c6d19105528938055141149bcb79aa80da37e82ac404f7892', `persistence_token` = '6379ba6324e5cc44c0035e19d4ad59b39e927c52bea0cf685da26b3af28e78da8e37abb4e61e18257968004446b2addb77245c4e75a572052c5d243acbaac290', `updated_at` = '2011-05-02 09:59:22' WHERE `users`.`id` = 450
---
  def reset_password
    @user = User.find(params[:id])
    @user.password= @user.password_confirmation=@user.email
   respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT `roles`.* FROM `roles` WHERE `roles`.`name` = 'vle_representative' LIMIT 1
SELECT COUNT(*) FROM `users` INNER JOIN `assignments` ON `users`.id = `assignments`.user_id WHERE ((`assignments`.role_id = 3))
SELECT `users`.* FROM `users` INNER JOIN `assignments` ON `users`.id = `assignments`.user_id WHERE ((`assignments`.role_id = 3)) ORDER BY name asc LIMIT 20 OFFSET 0
---
 def upload_password
  role = Role.find_by_name('vle_representative')
     @users = role.users.order.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )

UPDATE `users` SET `last_request_at` = '2011-05-02 09:22:31', `updated_at` = '2011-05-02 09:22:31' WHERE `users`.`id` = 2
---
  def csv_import
   @vle_user=CSV::Reader.parse(params[:upload][:file])
   n=0
   @vle_user.each do |row|
   user = User.create do |u|
       u.name  =row[0]
       u.email = row[1]
      u.password = u.password_confirmation = row[1]
      u.phone_number = row[2]
      u.status = 'Approved'
      u.created_by = 1
      u.updated_by=1
    end
    if user.save