app/views/admin/vle_representatives/_form.html.erb

            </label>
            <% for role in Role.where(:name=>'vle_representative') %>
            <%= check_box_tag "user[role_ids][]", role.id, @user.roles.include?(role) %>
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`name` = 'vle_representative'
SELECT `roles`.* FROM `roles` INNER JOIN `assignments` ON `roles`.id = `assignments`.role_id WHERE ((`assignments`.user_id = 461))

            </label>
            <%= profile.collection_select :state_id, State.order('name'), :id, :name ,{:prompt=>'Select State'},{ :onchange=>"#{remote_function(:url=>{:action=>'load_bidding_zones'},:with =>"'id='+value")}" } %>
---
SELECT `states`.* FROM `states` ORDER BY name

            </label>
            <%= profile.collection_select :bidding_zone_id,BiddingZone.all, :id, :name,{:prompt =>'Select Bidding Zone'} %>
---
SELECT `bidding_zones`.* FROM `bidding_zones`

            </label>
            <%= profile.collection_select :district_id, District.all,:id, :name,{:prompt =>'Select District'} %>
---
SELECT `districts`.* FROM `districts`

            </label>
            <%= profile.collection_select :csc_block_id, CscBlock.all,:id, :name,{:prompt =>'Select CSC Block'} %>
---
SELECT `csc_blocks`.* FROM `csc_blocks`