app/controllers/bankings_controller.rb

  def index
	  @bankings = Banking.where(:created_by=>current_user.id).search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )
---
SELECT `bankings`.* FROM `bankings` WHERE `bankings`.`created_by` = 451 ORDER BY name_of_holder asc LIMIT 5 OFFSET 0

  def edit_profile
   @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 457 LIMIT 1