app/controllers/district_managers_controller.rb

  def vle_profile
 #     role = Role.find_by_name('vle_representative')
 #     @vle_users = role.users.order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )
      @vlemail = User.find(:first, :conditions=>{:id=>@created_by})
      if @vlemail.email == 'chapra@sarkcsc.in'
       	  @vles=VleRepresentativeProfile.find(:all, :conditions=>{:district_id=>1})
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 451 LIMIT 1
SELECT `vle_representative_profiles`.* FROM `vle_representative_profiles` WHERE (`vle_representative_profiles`.user_id = 71) LIMIT 1

  def show
      @vle = VleRepresentativeProfile.find(params[:id])
---
SELECT `vle_representative_profiles`.* FROM `vle_representative_profiles` WHERE `vle_representative_profiles`.`id` = 1 LIMIT 1

  def edit_profile
     @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

    def update_profile
   @vle_user = User.find(params[:id])
    @vle_user.updated_by = @updated_by
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `updated_by` = 3, `password_salt` = 'bus2oi9TX414sdHjbnOX', `crypted_password` = 'f05ae4232a5ff43ca3fc1b7aea6f4a75d3cff95c95faec28c62ea25f350e855793dc80bf3662a269b3efd09d601a26c2dfc44cf81ba15183b4d7a0d0df862880', `persistence_token` = '8711a45cb7ab2a578efa6fb33851de83d8821df91117907f4403092e9cc2d587062c1017cd6b4dee1c5bd6151b62728f946e68bd984b26dd5ce73e999d3f9aa9', `phone_number` = '123456', `last_request_at` = '2011-05-03 07:17:04', `login_count` = 4, `last_login_at` = '2011-05-03 07:14:10', `current_login_at` = '2011-05-03 07:17:04', `updated_at` = '2011-05-03 07:17:04' WHERE `users`.`id` = 3

  def show_profile
  		@vle_user =  User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1