app/controllers/district_engineers_controller.rb

  def vle_profile
 #     role = Role.find_by_name('vle_representative')
 #     @vle_users = role.users.order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )
      @vlemail = User.find(:first, :conditions=>{:id=>@created_by})
      if @vlemail.email == 'chapraeng@sarkcsc.in'
       	  @vles=VleRepresentativeProfile.find(:all, :conditions=>{:district_id=>1})
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
SELECT `vle_representative_profiles`.* FROM `vle_representative_profiles` WHERE `vle_representative_profiles`.`district_id` = 1

  def show
      @vle = VleRepresentativeProfile.find(params[:id])
---
SELECT `vle_representative_profiles`.* FROM `vle_representative_profiles` WHERE `vle_representative_profiles`.`id` = 0 LIMIT 1

    def edit_profile
     @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1

    def update_profile
   @vle_user = User.find(params[:id])
    @vle_user.updated_by = @updated_by
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
UPDATE `users` SET `updated_by` = 9, `password_salt` = 'HyakbxWiT5tpy4qkL6W-', `crypted_password` = 'a535654db34bc1bad2b916534efb673600deec302ad72568f169c5a820f1be08159755dd5e77c3ae02d77ea1fdc268c02c8be1f189d704f41b12b8b92b20e31c', `persistence_token` = '41dc2dfa9831ca3c96e3aad982793af5a375ecf70f00e9c85a67ab853759dd64f606a63a99dc4848cade70c7174ee4490fed8ed15720beaf7326a9d2f73c6580', `last_request_at` = '2011-05-03 09:32:11', `login_count` = 5, `last_login_at` = '2011-05-03 09:27:13', `current_login_at` = '2011-05-03 09:32:11', `updated_at` = '2011-05-03 09:32:11' WHERE `users`.`id` = 9

  def show_profile
  		@vle_user =  User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1