app/controllers/transactions_controller.rb

  def index
  @transactions = Transaction.where(:created_by=>current_user.id).search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page =>page,:per_page=>per_page )
---
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`created_by` = 451 ORDER BY bank_name asc LIMIT 5 OFFSET 0