app/controllers/user_sessions_controller.rb

SELECT `users`.* FROM `users` WHERE (LOWER(`users`.email) = 'admin@cscone.com') LIMIT 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`name` = 'super_admin' LIMIT 1
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      flash[:notice] = "Login successful!"
      user = User.find_by_email(params[:user_session][:email])
      #  puts "############  #{user.id}"
      super_admin = Role.find_by_name('super_admin')