app/views/admin/users/_user.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---

<!-- <td><%=h User.find(user.created_by).name %></td> -->

UPDATE `users` SET `last_request_at` = '2011-05-05 06:24:22', `updated_at` = '2011-05-05 06:24:22' WHERE `users`.`id` = 2
---

 <td><%=h user.updated_at.strftime('%d-%m-%Y')%></td>